Repository: python/pootle-python-org-backup
Catalog: tmxes/fr/using.tmx
Source language: en
Languages: fr

source: Command line and environment
fr: Ligne de commande et environnement

source: The CPython interpreter scans the command line and the environment for various settings.
fr: L'interpréteur CPython analyse la ligne de commande et l'environnement à la recherche de différents paramètres/

source: Other implementations' command line schemes may differ. See :ref:`implementations` for further resources.
fr: Le format des lignes de commandes utilisées par d'autres implémentations peut être différent. Voir :ref:`implementations` pour plus d'informations.

source: Command line
fr: Ligne de commande

source: When invoking Python, you may specify any of these options::
fr: Quand vous invoquez Python, vous pouvez spécifier n’importe laquelle de ces options :

source: python [-bBdEhiOsSuvVWx?] [-c command | -m module-name | script | - ] [args]
fr: python [-bBdEhiOsSuvVWx?] [-c commande | -m nom-de-module | script | - ] [arguments]

source: The most common use case is, of course, a simple invocation of a script::
fr: Le cas d'utilisation le plus courant est, bien entendu, la simple invocation d'un script ::

source: python myscript.py
fr: python monscript.py

source: Interface options
fr: Options de l'interface

source: The interpreter interface resembles that of the UNIX shell, but provides some additional methods of invocation:
fr: L'interface de l’interpréteur ressemble à celle du shell UNIX, mais fournit quelques méthodes d'invocation supplémentaires :

source: When called with standard input connected to a tty device, it prompts for commands and executes them until an EOF (an end-of-file character, you can produce that with *Ctrl-D* on UNIX or *Ctrl-Z, Enter* on Windows) is read.
fr: Quand l'interpréteur est appelé avec l'entrée standard connectée à un périphérique tty, il lit les lignes de commande et les exécute jusqu'à ce qu'un caractère EOF (un caractère fin de fichier, que vous pouvez produire avec *Ctrl-D* sous UNIX ou *Ctrl-Z, Entrée* sous Windows) soit lu.

source: When called with a file name argument or with a file as standard input, it reads and executes a script from that file.
fr: Quand l'interpréteur est appelé avec argument correspondant à un nom de fichier ou avec un fichier comme entrée standard, il lit et exécute le script contenu dans ce fichier.

source: When called with a directory name argument, it reads and executes an appropriately named script from that directory.
fr: Quand l'interpréteur est appelé avec un argument correspondant à un répertoire, il lit et exécute un script nommé d’une certaine façon depuis ce répertoire.

source: When called with ``-c command``, it executes the Python statement(s) given as *command*. Here *command* may contain multiple statements separated by newlines. Leading whitespace is significant in Python statements!
fr: Quand l'interpréteur est appelé avec l'option ``-c commande``, il exécute la ou les instructions Python données comme *commande*. Ici *commande* peut contenir plusieurs instructions séparées par des fins de ligne. Les blancs en début de ligne ne sont pas ignorés dans les instructions Python !

source: When called with ``-m module-name``, the given module is located on the Python module path and executed as a script.
fr: Quand l'interpréteur est appelé avec l'option ``-m nom-de-module``, le module donné est recherché dans le chemin des modules Python et est exécuté en tant que script.

source: In non-interactive mode, the entire input is parsed before it is executed.
fr: En mode non-interactif, toute l’entrée est analysée avant d’être exécutée.

source: An interface option terminates the list of options consumed by the interpreter, all consecutive arguments will end up in :data:`sys.argv` -- note that the first element, subscript zero (``sys.argv[0]``), is a string reflecting the program's source.
fr: Une option d'interface termine la listes des options consommées par l'interpréteur ; tous les arguments échoueront dans :data:`sys.argv` — notez que le premier élément, à l'indice zéro (``sys.argv|0]``), est une chaîne de caractères indiquant la source du programme.

source: Execute the Python code in *command*. *command* can be one ore more statements separated by newlines, with significant leading whitespace as in normal module code.
fr: Exécute le code Python dans *commande*. *commande* peut être une ou plusieurs instructions, séparées par des fins de ligne, avec des blancs en début de ligne qui ne sont pas ignorés, comme dans le code d’un module.

source: If this option is given, the first element of :data:`sys.argv` will be ``"-c"`` and the current directory will be added to the start of :data:`sys.path` (allowing modules in that directory to be imported as top level modules).
fr: Si cette option est donnée, le premier élément de :data: `sys.argv` sera ``"-c"`` et le répertoire courant sera ajouté au début de :data: `sys.path` (permettant aux modules de ce répertoire d'être importé comme des modules de premier niveau).

source: Search :data:`sys.path` for the named module and execute its contents as the :mod:`__main__` module.
fr: Parcourir :data:`sys.path` à la recherche du module donné et exécuter son contenu en tant que module :mod:`__main__`.

source: Since the argument is a *module* name, you must not give a file extension (``.py``). The ``module-name`` should be a valid Python module name, but the implementation may not always enforce this (e.g. it may allow you to use a name that includes a hyphen).
fr: L'argument étant un nom de *module*, vous ne devez pas fournir d’extension de fichier (``.py``). Le ``nom-du-module` devrait être un nom de module Python valide, mais l'implémentation n’est pas tenue de le vérifier (par exemple, l'utilisation d'un trait d'union peut être autorisée).

source: Package names are also permitted. When a package name is supplied instead of a normal module, the interpreter will execute ``<pkg>.__main__`` as the main module. This behaviour is deliberately similar to the handling of directories and zipfiles that are passed to the interpreter as the script argument.
fr: Les noms de paquets sont aussi autorisés. Quand un nom de paquet est donné à la place d'un module habituel, l'interpréteur exécutera ``<pkg>.__main`` comme module principal. Ce comportement est délibérement identique que pour un répertoire on un fichier zip donné à l'interpréteur comme argument à exécuter.

source: This option cannot be used with built-in modules and extension modules written in C, since they do not have Python module files. However, it can still be used for precompiled modules, even if the original source file is not available.
fr: Cette option ne peut pas être utilisée avec les modules intégrés et les modules d'extension écrits en C, étant donné qu'il ne possèdent pas de fichiers modules en Python. Cependant, elle peut toujours être utilisées pour les modules pré-complilés, même si le fichier source original n'est pas disponible.

source: If this option is given, the first element of :data:`sys.argv` will be the full path to the module file. As with the :option:`-c` option, the current directory will be added to the start of :data:`sys.path`.
fr: Si cette option est donnée, le premier élément de :data:`sys.argv` sera le chemin complet d'accès au fichier du module. Comme pour l'option :option:`-c`, le répertoire courant sera ajouté au début de :data:`sys.path`.

source: Many standard library modules contain code that is invoked on their execution as a script. An example is the :mod:`timeit` module::
fr: De nombreux modules de la bibliothèque standard contiennent du code qui est invoqué quand ils sont exécutés comme scripts. Un exemple est le module :mod:`timeit`\ ::

source: python -mtimeit -s 'setup here' 'benchmarked code here' python -mtimeit -h # for details
fr: python -mtimeit -s 'préparation ici' 'code à chronométrer ici'python -mtimeit -h # pour les détails

source: See also
fr: Voir aussi

source: :pep:`338` -- Executing modules as scripts
fr: :pep:`338` -- Exécuter des modules en tant que scripts

source: Read commands from standard input (:data:`sys.stdin`). If standard input is a terminal, :option:`-i` is implied.
fr: Lit les commandes depuis l'entrée standard (:data:`sys.stdin`). Si l'entrée standard est un terminal, l':option:`-i` est activée implicitement.

source: Execute the Python code contained in *script*, which must be a filesystem path (absolute or relative) referring to either a Python file, a directory containing a ``__main__.py`` file, or a zipfile containing a ``__main__.py`` file.
fr: Exécute le code Python contenu dans *script*, qui doit être un chemin d'accès au fichier (absolu ou relatif), se référant à un fichier Python, à un répertoire contenant un fichier ``__main__.py`` ou à un fichier zip contenant un fichier ``__main__.py``.

source: If this option is given, the first element of :data:`sys.argv` will be the script name as given on the command line.
fr: Si cette option est donnée, le premier élément de :data:`sys.argv` sera le nom du script comme donné sur la ligne de commande.

source: Issue a warning when comparing str and bytes. Issue an error when the option is given twice (:option:`-bb`).
fr: Émettre un avertissement lorsque l'on compare un str et un bytes. Émettre une erreur lorsque l'option est donné deux fois (:option:`-bb`).

source: If given, Python won't try to write ``.pyc`` or ``.pyo`` files on the import of source modules. See also :envvar:`PYTHONDONTWRITEBYTECODE`.
fr: Si donné, Python ne tentera pas d'écrire de fichier ``.pyc``` ou ``.pyo`` à l'importation des modules source. Voir aussi :envvar:`PYTHONDONTWRITEBYTECODE`.

source: Turn on parser debugging output (for wizards only, depending on compilation options). See also :envvar:`PYTHONDEBUG`.
fr: Activer la sortie de l'analyseur de débogage (pour les magiciens uniquement, en fonction des options de compilation). Voir aussi :envvar:`PYTHONDEBUG`.

source: Ignore all :envvar:`PYTHON*` environment variables, e.g. :envvar:`PYTHONPATH` and :envvar:`PYTHONHOME`, that might be set.
fr: Ignorer toutes les variables d'environnement :envvar:`PYTHON*`, par exemple, :envvar:`PYTHONPATH` et :envvar:`PYTHONHOME`, qui pourraient être définies.

source: When a script is passed as first argument or the :option:`-c` option is used, enter interactive mode after executing the script or the command, even when :data:`sys.stdin` does not appear to be a terminal. The :envvar:`PYTHONSTARTUP` file is not read.
fr: Quand un script est passé comme premier argument ou que l'option :option:`-c` est utilisée, entrer en mode interactif après avoir exécuté le script ou la commande, même lorsque :data:`sys.stdin` ne semble pas être un terminal. Le fichier :envvar:`PYTHONSTARTUP` n'est pas lu.

source: This can be useful to inspect global variables or a stack trace when a script raises an exception. See also :envvar:`PYTHONINSPECT`.
fr: Cela peut être utile pour examiner les variables globales ou une trace de la pile lorsque le script lève une exception. Voir aussi :envvar:`PYTHONINSPECT`.

source: Turn on basic optimizations. This changes the filename extension for compiled (:term:`bytecode`) files from ``.pyc`` to ``.pyo``. See also :envvar:`PYTHONOPTIMIZE`.
fr: Activer les optimisations de base. Cela modifie l'extension du fichier pour les fichiers compilés (:term:`bytecode`) de ``.pyc`` à ``.pyo``. Voir aussi :envvar:`PYTHONOPTIMIZE`.

source: Discard docstrings in addition to the :option:`-O` optimizations.
fr: Supprimer les docstrings en plus des optimisations réalisés par :option:`-O`.

source: Don't add user site directory to sys.path
fr: Ne pas ajouter le répertoire spécifique de l’utilisateur à sys.path

source: Disable the import of the module :mod:`site` and the site-dependent manipulations of :data:`sys.path` that it entails.
fr: Désactiver l’importation du module :mod:`site` et les modifications de :data:`sys.path` spécifiques au site qu’elle implique.

source: See also :envvar:`PYTHONUNBUFFERED`.
fr: Voir aussi :envvar:`PYTHONUNBUFFERED`.

source: :pep:`230` -- Warning framework
fr: :pep:`230` -- Gestion des alertes

source: Options you shouldn't use
fr: Options que vous ne devriez pas utiliser

source: Environment variables
fr: Variables d'environnement

source: How To Manage Environment Variables in Windows XP
fr: Comment gérer les variables d'environnement sous Windows XP

source: Setting Environment variables, Louis J. Farrugia
fr: Définir les variables d'environnement, Louis J. Farrugia

source: The `PyWin32 <http://python.net/crew/mhammond/win32/>`_ module by Mark Hammond is a collection of modules for advanced Windows-specific support. This includes utilities for:
fr: Le module `PyWin32 <http://python.net/crew/mhammond/win32/>`_ de Mark Hammond est une collection de modules pour un support avancé spécifique à Windows. Cela inclut les services pour :

source: Win32 API calls
fr: Appels à l'API Win32

source: `Microsoft Foundation Classes <http://msdn.microsoft.com/en-us/library/fe1cf721%28VS.80%29.aspx>`_ (MFC) user interfaces
fr: `Microsoft Foundation Classes <http://msdn.microsoft.com/en-us/library/fe1cf721%28VS.80%29.aspx>`_ (MFC) interfaces utilisateur

source: `PythonWin <http://web.archive.org/web/20060524042422/ http://www.python.org/windows/pythonwin/>`_ is a sample MFC application shipped with PyWin32. It is an embeddable IDE with a built-in debugger.
fr: `PythonWin <http://web.archive.org/web/20060524042422/ http://www.python.org/windows/pythonwin/>`_ est une exemple d'application MFC livrée avec PyWin32. Il s'agit d'un IDE embarqué avec débogueur intégré.

source: by Tim Golden
fr: par Tim Golden

source: by David and Paul Boddie
fr: par David et Paul Boddie

source: Compiling Python on Windows
fr: Compiler Python sous Windows

source: Directory
fr: Répertoire

source: MSVC version
fr: version de MSVC

source: Visual Studio version
fr: Version de Visual Studio

source: Check :file:`PC/readme.txt` for general information on the build process.
fr: Vérifiez :file:`PC/readme.txt` pour des informations générales sur le processus de construction.

source: by Trent Apted et al, 2007
fr: par Trent Apted et al, 2007

source: Other resources
fr: Autres ressources

source: "Help for Windows Programmers" by Mark Hammond and Andy Robinson, O'Reilly Media, 2000, ISBN 1-56592-621-8
fr: "Help for Windows Programmers" de Mark Hammond et Andy Robinson, O'Reilly Media, 2000, ISBN 1-56592-621-8

source: by Amanda Birmingham, 2004
fr: par Amanda Birmingham, 2004
